<a href="https://colab.research.google.com/github/raklives/practice-projects/blob/master/creating_test_dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
# in marketing, creating new dataframes is especially important to know when 
# trying to establish new data pipelines
# you want to have sets of data to practice running your scripts through

In [0]:
# start by learning how to filter and select data

# slect a column resulting in a series
df[col]

#select multiple columns resulting in a new datafram
df[[col1, col2]]

# select a row label resulting in a series
df.loc[label]

# select a row integer location resulting in a series
df.iloc[loc]

# slice rows resulting in a dataframe
df[start_idx: end_idx]

# select multiple rows by Boolean vector resulting in a dataframe
df[bool_vec]

### Creating Test Dataframes

In [0]:
# import pandas
import pandas as pd
import copy

In [5]:
# different ways to create a data frame
pd.DataFrame([1,2,3], columns=['category'])
pd.DataFrame.from_dict({'category': [1,2,3]})
pd.DataFrame({'category': pd.Series([1,2,3])})

   category
0         1
1         2
2         3

In [10]:
# by passing pandas objects into the DataFrame function
df1 = pd.DataFrame(pd.Series([1,2,3]), columns=['category'])

#see
df1

   category
0         1
1         2
2         3

In [0]:
# we're basically dopying the df1 dataframe completely
# what we end up with is a dataframe that is just the same as df1 but not linked 
# anyway
df = copy.deepcopy(df1)

### Adding and Removing Attributes and Observations

In [0]:
# there are plenty tools to use
# some allow you to drop rows or columns
# some allow you to only select a few rows
# some allow you to dropna values

# it is also possible to combine different dataframes using things like concat, 
# append, etc

### Creating and Modifying Test DataFrame

In [55]:
# here we're practicing how to create a dataframe ad then copy it

# create
likes = pd.DataFrame({'catagory': pd.Series([1,2,3])})
# check
likes.head()

   catagory
0         1
1         2
2         3

In [56]:
# now let's make a duplicate of this dataframe
likes_copy = copy.deepcopy(likes)
#check
likes.head()

   catagory
0         1
1         2
2         3

In [57]:
# after we've copied out dataframe, we can now do things to it like
# adding new columns/attributes or rows/observations

# add a new column called cities to the like_copy dataframe
likes_copy['cities'] = pd.Series([['Delhi', 'Mumbai'], ['Lucknow', 'Bhopl'], ['Chennai', 'Bangladore']])

#check to see if our new column/attribute was added
likes_copy.head()

   catagory                 cities
0         1        [Delhi, Mumbai]
1         2       [Lucknow, Bhopl]
2         3  [Chennai, Bangladore]

In [58]:
# now let's add alot more attributes about veiwers to to the dataframe

likes_copy.assign(
    young_viewers = pd.Series([2000000, 3000000, 15000000]), 
    adult_viewers = pd.Series([2500000, 3500000, 1600000]),
    aged_viewers = pd.Series([2300000, 2800000, 2000000])
)

# check
likes_copy.head()

   catagory                 cities
0         1        [Delhi, Mumbai]
1         2       [Lucknow, Bhopl]
2         3  [Chennai, Bangladore]

In [0]:
likes_copy['young_viewers'] = pd.Series([2000000, 3000000, 15000000])
likes_copy['adult_viewers'] = pd.Series([2500000, 3500000, 1600000])
likes_copy['aged_viewers'] = pd.Series([2300000, 2800000, 2000000])

In [62]:
likes_copy.head()

   catagory                 cities  young_viewers  adult_viewers  aged_viewers
0         1        [Delhi, Mumbai]        2000000        2500000       2300000
1         2       [Lucknow, Bhopl]        3000000        3500000       2800000
2         3  [Chennai, Bangladore]       15000000        1600000       2000000